PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs_0126/bluetooth.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
						printf("idle\r\n");
            //sleep_mode_enter();
						advertising_start();
            break;
        default:
            break;
    }
}

void ble_send_data(uint8_t *data, uint16_t length)
{
#if BLE_STREAM_ATTENTION_ONLY
    if ((data == NULL) ||
        (length != 12U) ||
        (data[0] != 0xA5U) ||
        (data[1] != 0x5AU) ||
        (data[2] != 0x01U) ||
        (data[3] != 0x01U))
    {
        return;
    }
#endif

    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        printf("No active connection\r\n");
        return;
    }

    if (!m_nus_notifications_enabled) {
        return;
    }

		if(!nrf_sdh_is_enabled() ){
			 printf("NUS service not readyy \r\n");
       vTaskDelay(pdMS_TO_TICKS(100));
       return ;
		}
    if (length == 0 || data == NULL) {
        printf("Invalid data parameters\r\n");
        return;
    }

    ret_code_t err_code;

//    do {   //do
        err_code = ble_nus_data_send(&m_nus, data, &length, m_conn_handle);
			
				switch (err_code) {
            case NRF_SUCCESS:
						
                return;
                
            case NRF_ERROR_INVALID_STATE:
                //printf("NUS service not ready \r\n");
                vTaskDelay(pdMS_TO_TICKS(100));
                break;
                
            case NRF_ERROR_INVALID_PARAM:
                printf("Invalid parameters. Check NUS initialization \r\n" );
                vTaskDelay(pdMS_TO_TICKS(100));
                break;
                
            case NRF_ERROR_RESOURCES:
                printf("BLE stack busy \r\n");
                vTaskDelay(pdMS_TO_TICKS(10));
                break;
            
						case NRF_ERROR_NO_MEM:
								printf("NO MEM     ");
								printf("FreeRTOS heap free: %lu bytes          \r\n", xPortGetFreeHeapSize());

                break;
						
            default:
								printf("Send failed: 0x%X \r\n", err_code);    //401:BLE_ERROR_GATTS_SYS_ATTR_MISSING
                vTaskDelay(pdMS_TO_TICKS(100));
                break;
				}
			
//    } while (err_code != NRF_SUCCESS);
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */





extern int spo2_wake_up;
void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
					  nrf_connect_stable_flag=1;

            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
				

				
//						if (xSemaphoreGive(wake_up_sem) == pdTRUE) {
//								printf("wake_up_sem released\r\n");
//						} else {
//								printf("wake_up_sem give failed\r\n");
//						}
//						flag_run = 1;
//						if (xSemaphoreGive(max_wake_up_sem) == pdTRUE) {
//								printf("max_wake_up_sem released\r\n");
//						} else {
//								printf("max_wake_up_sem give failed\r\n");
//						}
						

				

            break;

        case BLE_GAP_EVT_DISCONNECTED:
					  nrf_connect_stable_flag=0;
                      m_nus_notifications_enabled = false;
				
            // LED indication will be changed when advertising starts.
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
				
//						xSemaphoreGive(enter_low_power_sem);
//       			spo2_wake_up=0;			
						printf("disconnect\r\n");
				
	
				
						
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            //printf("PHY update request.\r\n");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,   //BLE_GAP_PHY_AUTO    BLE_GAP_PHY_2MBPS
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
						printf("BLE_GAP_EVT_PHY_UPDATE_REQUEST\r\n");
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
				  
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
				
				printf("BLE_GAP_EVT_SEC_PARAMS_REQUEST\r\n");
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
				   
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
				
							printf("BLE_GATTS_EVT_SYS_ATTR_MISSING\r\n");
            break;

        case BLE_GATTC_EVT_TIMEOUT:
					
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
							printf("BLE_GATTC_EVT_TIMEOUT\r\n");
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
						
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
							printf("BLE_GATTS_EVT_TIMEOUT\r\n");
            break;
	
				case BLE_GAP_EVT_SCAN_REQ_REPORT:
						printf("scan report\r\n");
						break;
				case BLE_GAP_EVT_CONN_PARAM_UPDATE:
						printf("BLE_GAP_EVT_CONN_PARAM_UPDATE.\r\n");
				    //nrf_connect_stable_flag=1;
						break;
				case BLE_GAP_EVT_PHY_UPDATE:
						printf("BLE_GAP_EVT_PHY_UPDATE.....\r\n");
						//printf("PHY updated. TX PHY: %d, RX PHY: %d\r\n",p_ble_evt->evt.gap_evt.params.phy_update.tx_phy,lanya p_ble_evt->evt.gap_evt.params.phy_update.rx_phy);

						break;
        default:
            // No implementation needed.
						// // // printf("default\r\n");
            break;
    }
}




