PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs_0126/bluetooth.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; //BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE    BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE   BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;  //APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;
	
		init.config.ble_adv_slow_enabled  = true;       
		init.config.ble_adv_slow_interval = MSEC_TO_UNITS(1000, UNIT_0_625_MS); 
		init.config.ble_adv_slow_timeout  = 0;         
	
	

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
		
//		err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,m_advertising.adv_handle,8);
//		if (err_code == NRF_SUCCESS) {
//				printf("TX Power set to: 8 dBm\r\n");
//		} else {
//				printf("Failed to set TX power: 0x%X\r\n", err_code);
//		}
}




void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();	
    }
}


void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}




//发送ecg数据
#define ECG_DATA_BUFFER_SIZE 200
#if 0 /* Legacy filtered-EEG sender; attention frames are the active protocol. */
static void ble_send_filtered_eeg_thread(void *pvParameter)
{
    uint8_t data_buffer[ECG_DATA_BUFFER_SIZE]; // 发送缓冲区
    uint16_t buffer_index = 0;

    while(1) {
			
				if( read_ecg_pos != write_ecg_pos ){  

        data_buffer[buffer_index++] = (save_ecg_data[read_ecg_pos] >> 24) & 0xFF;
        data_buffer[buffer_index++] = (save_ecg_data[read_ecg_pos]  >> 16) & 0xFF;
        data_buffer[buffer_index++] = (save_ecg_data[read_ecg_pos]  >> 8)  & 0xFF;
        data_buffer[buffer_index++] = (save_ecg_data[read_ecg_pos]) & 0xFF;
        
        if(buffer_index >= ECG_DATA_BUFFER_SIZE) {
            if((nrf_connect_stable_flag == 1) && m_nus_notifications_enabled) {
                ble_send_data(data_buffer, buffer_index);
            }
            buffer_index = 0; 
        }					
					read_ecg_pos =(read_ecg_pos+1+CYC_ARR_LEN)%CYC_ARR_LEN;	
				}
        
       	vTaskDelay(pdMS_TO_TICKS(10));   
    }
}





//发送六轴数据
#endif

#define ATTENTION_PACKET_MAGIC_0       0xA5U
#define ATTENTION_PACKET_MAGIC_1       0x5AU
#define ATTENTION_PACKET_VERSION       0x01U
#define ATTENTION_PACKET_TYPE          0x01U
#define ATTENTION_PACKET_PAYLOAD_LEN   0x06U
#define ATTENTION_PACKET_SIZE          12U

#define ATTENTION_FLAG_VALID           (1U << 0)
#define ATTENTION_FLAG_FOCUSED         (1U << 1)
#define ATTENTION_FLAG_CALIBRATING     (1U << 2)
#define ATTENTION_FLAG_ARTIFACT        (1U << 3)

static uint8_t attention_packet_checksum(
    const uint8_t *data,
    uint16_t length
)
{
    uint8_t checksum = 0U;
    uint16_t i;

    for (i = 0U; i < length; i++)
    {
        checksum ^= data[i];
    }

    return checksum;
}


static void attention_encode_packet(
    const attention_result_t *result,
    uint8_t packet[ATTENTION_PACKET_SIZE]
)
{
    uint8_t flags = 0U;
    uint32_t window = result->processed_windows;

    if (result->valid)
    {
        flags |= ATTENTION_FLAG_VALID;
    }
    if (result->focused)
    {
        flags |= ATTENTION_FLAG_FOCUSED;
    }
    if (result->calibrating)
    {
        flags |= ATTENTION_FLAG_CALIBRATING;
    }
    if (result->artifact)
    {
        flags |= ATTENTION_FLAG_ARTIFACT;
    }

    packet[0] = ATTENTION_PACKET_MAGIC_0;
    packet[1] = ATTENTION_PACKET_MAGIC_1;
    packet[2] = ATTENTION_PACKET_VERSION;
    packet[3] = ATTENTION_PACKET_TYPE;
    packet[4] = ATTENTION_PACKET_PAYLOAD_LEN;
    packet[5] = flags;
    packet[6] = result->score;
    packet[7] = (uint8_t)((window >> 24) & 0xFFU);
    packet[8] = (uint8_t)((window >> 16) & 0xFFU);
    packet[9] = (uint8_t)((window >> 8) & 0xFFU);
    packet[10] = (uint8_t)(window & 0xFFU);
    packet[11] = attention_packet_checksum(packet, 11U);
}


void ble_send_thread(void *pvParameter)
{
    attention_result_t result;
    uint8_t packet[ATTENTION_PACKET_SIZE];
    uint32_t last_sent_window = 0U;

    (void)pvParameter;

    for (;;)
    {
        if ((nrf_connect_stable_flag == 1) &&
            m_nus_notifications_enabled &&
            attention_get_result(&result) &&
            (result.processed_windows != last_sent_window))
        {
            attention_encode_packet(&result, packet);
            ble_send_data(packet, ATTENTION_PACKET_SIZE);
            last_sent_window = result.processed_windows;
        }

        vTaskDelay(pdMS_TO_TICKS(50U));
    }
}


//extern QueueHandle_t sensor_data_queue;
//void ble_send_thread(void * pvParameter)
//{
//    sensor_data_t data;
//    uint8_t tx_buffer[52];  // 6 float * 4 + 7 int32 * 4 = 52
//    
//    while (1) {
//        // 等待数据
//        if (xQueueReceive(sensor_data_queue, &data, portMAX_DELAY) == pdTRUE) {
//            // 打包数据
//            memcpy(&tx_buffer[0], &data.ax, sizeof(float));
//            memcpy(&tx_buffer[4], &data.ay, sizeof(float));
//            memcpy(&tx_buffer[8], &data.az, sizeof(float));
//            memcpy(&tx_buffer[12], &data.gx, sizeof(float));
//            memcpy(&tx_buffer[16], &data.gy, sizeof(float));
//            memcpy(&tx_buffer[20], &data.gz, sizeof(float));
//					
//            memcpy(&tx_buffer[24], &data.year, sizeof(int));
//            memcpy(&tx_buffer[28], &data.month, sizeof(int));
//            memcpy(&tx_buffer[32], &data.day, sizeof(int));
//            memcpy(&tx_buffer[36], &data.weekday, sizeof(int));
//            memcpy(&tx_buffer[40], &data.hour, sizeof(int));
//            memcpy(&tx_buffer[44], &data.min, sizeof(int));
//            memcpy(&tx_buffer[48], &data.second, sizeof(int));
//					    
//            ble_send_data(tx_buffer, sizeof(tx_buffer));
//            
//            vTaskDelay(pdMS_TO_TICKS(100));
//        }
//    }
//}





////发送字符串25.6
//#define ECG_DATA_BUFFER_SIZE 200
//void ble_send_thread(void * pvParameter)
//{
//    while(1) {
//			
//        if(nrf_connect_stable_flag == 1) {
//// 方法2：发送格式化字符串
//float temperature = 25.6f;
//char buffer[20];
//int len = snprintf(buffer, sizeof(buffer), "%.1f", temperature);
//uint16_t length = len;
//ble_nus_data_send(&m_nus, (uint8_t*)buffer, &length, m_conn_handle);
//// 发送："25.6" 字符串
//        }
//					
//       	vTaskDelay(pdMS_TO_TICKS(10));   
//    }
//}




void ble_thread(void * pvParameter)
{
    bool erase_bonds;
	
	  printf("ble_thread\r\n");

	
    timers_init();
    power_management_init();
	


    ble_stack_init();

    gap_params_init();

    gatt_init();

    services_init();

    advertising_init();

    conn_params_init();


    advertising_start();
			

		printf("advertising...\r\n");

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
				vTaskDelay(pdMS_TO_TICKS(100));
    }
		

}


